{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Un développeur full-stack axé sur les résultats, avec de solides compétences en optimisation des performances et en efficacité. Engagé à fournir des solutions pragmatiques qui répondent aux besoins du client avec éthique et responsabilité.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "Ces dernières années, mon parcours dans le développement a été marqué par une narration stimulante, remplie de réalisations et d'apprentissages significatifs. Lorsque j'ai entrepris ce voyage, j'ai dû affronter une courbe d'apprentissage raide, plongeant dans les complexités du front-end et du back-end. Chaque ligne de code était une réussite, et chaque défi était une opportunité de croissance. Concevoir des interfaces intuitives et élaborer des solutions robustes est devenu mon mantra quotidien.\n\nCependant, la véritable essence du développement va au-delà du code. Je me suis retrouvé régulièrement confronté à traduire les besoins des clients en solutions tangibles. De plus, l'importance de la sécurité des données et du respect de la vie privée des utilisateurs est devenue des aspects intégraux de mon travail quotidien.\n\nCes années de développement ne sont pas qu'un chapitre mais la fondation de ce qui est à venir. Je suis impatient d'embrasser les opportunités futures, d'appliquer les connaissances acquises et de contribuer à façonner le paysage technologique en constante évolution.",
  "Intelie by Viasat": "Intelie par Viasat",
  "Mid-level Software Developer": "Développeur de logiciels de niveau intermédiaire",
  "Junior Software Developer": "Développeur de logiciels junior",
  "Software Developer Trainee": "Stagiaire développeur logiciel",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Licence en informatique - UERJ",
  "IT Techinical Education - IEPB": "Éducation technique en informatique - IEPB",
  "Communication: How to express yourself effectively and be understood": "Communication : Comment s'exprimer efficacement et être compris",
  "Oratory 1": "Oratoire 1",
  "Oratory 2": "Oratoire 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Tests unitaires en Java - JUnit, Mockito et TDD",
  "Vim Masterclass": "Masterclass Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Conception pilotée par le domaine",
  "Java Persistence API and Hibernate": "API de persistance Java et Hibernate",
  "Python 3 Basics": "Bases de Python 3",
  "Languages": "Langues",
  "Experiences": "Expériences",
  "Certifications": "Certifications",
  "Projects": "Projets",
  "About": "À propos",
  "Made with": "Fait avec",
  "by Lucas Morais": "par Lucas Morais",
  "Educations": "Formations",
  "Time worked": "Temps travaillé",
  "Now": "Maintenant",
  "hours worked": "heures travaillées",
  "Brazil": "Brésil",
  "United States of America": "États-Unis",
  "France": "France",
  "Spain": "Espagne",
  "South Korea": "Corée du Sud",
  "Japan": "Japon",
  "Germany": "Allemagne",
  "Italy": "Italie",
  "China": "Chine",
  "Saudi Arabia": "Arabie Saoudite",
  "Portuguese": "Portugais",
  "English": "Anglais",
  "French": "Français",
  "Spanish": "Espagnol",
  "Korean": "Coréen",
  "Japanese": "Japonais",
  "German": "Allemand",
  "Italian": "Italien",
  "Chinese": "Chinois",
  "Arabic": "Arabe",
  "year": "an",
  "years": "ans",
  "month": "mois",
  "months": "mois",
  "day": "jour",
  "days": "jours",
  "High School": "Lycée",
  "Instituto de Educação Pereira Batista": "Institut d'éducation Pereira Batista",
  "Colégio Casimiro de Abreu": "Collège Casimiro de Abreu",
  "Primary School": "École primaire",
  "Centro Educacional Vilar Novo": "Centre éducatif Vilar Novo",
  "Fundação Pestalozzi": "Fondation Pestalozzi",
  "Colégio Soberano": "Collège Soberano",
  "Java Multithreading Concurrency Performance Optimization": "Java Multithreading, Concurrence et Optimisation des Performances",
  "Learn Rust By Building Real Applications": "Apprenez Rust en Construisant des Applications Réelles",
  "**Common Data Framework (CoDaF)**: I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\n**CoDaF Wells and Rigs**: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\n**Atria**: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\n**License Manager**: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\n**Rig State**: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "**Common Data Framework (CoDaF)**: Je suis devenu l'un des principaux responsables techniques chargés de maintenir et d'améliorer les fonctionnalités d'un cadre interne pour la persistance des données communes, créant une base centralisée pour différents projets.\n\n**CoDaF Wells and Rigs**: J'ai interviewé des spécialistes et modélisé une base de données à usage général pour les solutions pétrolières et gazières, résultant en environ 100 entités.\n\n**Atria**: J'ai dirigé techniquement et mis en œuvre un projet pilote pour intégrer le traitement en temps réel des données de Machine Learning relatives à l'état d'intégrité de plusieurs antennes.\n\n**License Manager**: J'ai conçu, planifié et mis en œuvre le License Manager, un projet visant à contrôler et surveiller l'accès des clients aux produits (plugins) selon la licence contractée, empêchant l'utilisation abusive des solutions dans les environnements embarqués. J'ai préparé une présentation expliquant la fonctionnalité de haut niveau aux responsables concernés.\n\n**Rig State**: J'ai réalisé une ingénierie inverse sur une application sans documentation adéquate pour fournir une plus grande clarté aux gestionnaires sur les règles commerciales mises en œuvre, permettant les modifications nécessaires.",
  "**Sequence Builder + Cost Tracker**: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\n**Dynamic Risk Advisor (DRA)**: I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "**Sequence Builder + Cost Tracker**: J'ai été parmi les principaux contributeurs au développement du Sequence Builder, un système qui génère des simulations résultant en une séquence d'opérations avec des estimations de temps basées sur des données historiques pour la planification des activités des puits de pétrole. En parallèle, il y a eu le développement du Cost Tracker, qui fonctionne couplé avec le Sequence Builder en ajoutant des estimations de coûts pour chaque opération pendant la simulation. De plus, il permet la mise à jour et le suivi de ces opérations en fonction des données réelles, permettant des comparaisons entre le planifié et l'exécuté.\n\n**Dynamic Risk Advisor (DRA)**: J'ai participé temporairement au développement du projet DRA, un outil basé sur la méthodologie bowtie, permettant à l'utilisateur de gérer et surveiller les barrières et les alertes en temps réel, visant une gestion optimisée des risques opérationnels.",
  "**Campaign Planner:** Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\n**PDF Extractor:** Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "**Campaign Planner:** Contribué au développement de nouvelles fonctionnalités, à la maintenance et à la compatibilité avec les anciens navigateurs dans une application de gestion de campagnes pour les opérations pétrolières et gazières.\n\n**PDF Extractor:** Responsable de la mise en œuvre d'un script pour convertir divers fichiers PDF en un format CSV spécifique en utilisant l'OCR, aidant l'équipe de recherche à obtenir des données structurées pour les modèles d'apprentissage automatique."
}
