{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Un développeur full-stack axé sur les résultats, avec de solides compétences en optimisation des performances et en efficacité. Engagé à fournir des solutions pragmatiques qui répondent aux besoins du client avec éthique et responsabilité.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "Ces dernières années, mon parcours dans le développement a été marqué par une narration stimulante, remplie de réalisations et d'apprentissages significatifs. Lorsque j'ai entrepris ce voyage, j'ai dû affronter une courbe d'apprentissage raide, plongeant dans les complexités du front-end et du back-end. Chaque ligne de code était une réussite, et chaque défi était une opportunité de croissance. Concevoir des interfaces intuitives et élaborer des solutions robustes est devenu mon mantra quotidien.\n\nCependant, la véritable essence du développement va au-delà du code. Je me suis retrouvé régulièrement confronté à traduire les besoins des clients en solutions tangibles. De plus, l'importance de la sécurité des données et du respect de la vie privée des utilisateurs est devenue des aspects intégraux de mon travail quotidien.\n\nCes années de développement ne sont pas qu'un chapitre mais la fondation de ce qui est à venir. Je suis impatient d'embrasser les opportunités futures, d'appliquer les connaissances acquises et de contribuer à façonner le paysage technologique en constante évolution.",
  "Intelie by Viasat": "Intelie par Viasat",
  "Mid-level Software Developer": "Développeur de logiciels de niveau intermédiaire",
  "Junior Software Developer": "Développeur de logiciels junior",
  "Software Developer Trainee": "Stagiaire développeur logiciel",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Licence en informatique - UERJ",
  "IT Techinical Education - IEPB": "Éducation technique en informatique - IEPB",
  "Communication: How to express yourself effectively and be understood": "Communication : Comment s'exprimer efficacement et être compris",
  "Oratory 1": "Oratoire 1",
  "Oratory 2": "Oratoire 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Tests unitaires en Java - JUnit, Mockito et TDD",
  "Vim Masterclass": "Masterclass Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Conception pilotée par le domaine",
  "Java Persistence API and Hibernate": "API de persistance Java et Hibernate",
  "Python 3 Basics": "Bases de Python 3",
  "Languages": "Langues",
  "Experiences": "Expériences",
  "Certifications": "Certifications",
  "Projects": "Projets",
  "About": "À propos",
  "Made with": "Fait avec",
  "by Lucas Morais": "par Lucas Morais",
  "Educations": "Formations",
  "Time worked": "Temps travaillé",
  "Now": "Maintenant",
  "hours worked": "heures travaillées",
  "Brazil": "Brésil",
  "United States of America": "États-Unis",
  "France": "France",
  "Spain": "Espagne",
  "South Korea": "Corée du Sud",
  "Japan": "Japon",
  "Germany": "Allemagne",
  "Italy": "Italie",
  "China": "Chine",
  "Saudi Arabia": "Arabie Saoudite",
  "Portuguese": "Portugais",
  "English": "Anglais",
  "French": "Français",
  "Spanish": "Espagnol",
  "Korean": "Coréen",
  "Japanese": "Japonais",
  "German": "Allemand",
  "Italian": "Italien",
  "Chinese": "Chinois",
  "Arabic": "Arabe",
  "year": "an",
  "years": "ans",
  "month": "mois",
  "months": "mois",
  "day": "jour",
  "days": "jours",
  "High School": "Lycée",
  "Instituto de Educação Pereira Batista": "Institut d'éducation Pereira Batista",
  "Colégio Casimiro de Abreu": "Collège Casimiro de Abreu",
  "Primary School": "École primaire",
  "Centro Educacional Vilar Novo": "Centre éducatif Vilar Novo",
  "Fundação Pestalozzi": "Fondation Pestalozzi",
  "Colégio Soberano": "Collège Soberano",
  "Java Multithreading Concurrency Performance Optimization": "Java Multithreading, Concurrence et Optimisation des Performances",
  "Learn Rust By Building Real Applications": "Apprenez Rust en Construisant des Applications Réelles"
}
