{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "결과에 집중하는 풀 스택 개발자로, 성능 최적화 및 효율성에 강한 기술을 가지고 있습니다. 윤리적이고 책임감 있는 고객이 필요로 하는 실용적인 솔루션을 제공합니다.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "최근 몇 년간의 개발 여정은 도전적인 이야기로 가득 찼으며, 성취와 의미 있는 배움으로 가득합니다. 이 여정에 나서면서, 나는 가파른 학습 곡선에 직면하여 프런트엔드와 백엔드의 복잡성에 대해 탐구했습니다. 각 줄의 코드는 성취였고, 각 도전은 성장의 기회였습니다. 직관적인 인터페이스를 만들고 견고한 솔루션을 설계하는 것이 내 매일의 말씀이 되었습니다.\n\n그러나 개발의 진정한 본질은 코드를 넘어섭니다. 고객의 요구를 구체적인 해결책으로 번역하는 데 항상 도전해야 했습니다. 또한, 데이터 보안의 중요성과 사용자 개인 정보의 존중이 내 일상적인 작업의 필수 요소가 되었습니다.\n\n이 개발의 몇 년은 단순히 한 장이 아닌 앞으로의 기반입니다. 저는 미래의 기회를 기대하며 얻은 지식을 적용하고 끊임없이 발전하는 기술적 풍경을 조성하는 데 기여할 것을 기대합니다.",
  "Intelie by Viasat": "인텔리 by 비아섯",
  "Mid-level Software Developer": "중급 소프트웨어 개발자",
  "Junior Software Developer": "초급 소프트웨어 개발자",
  "Software Developer Trainee": "소프트웨어 개발자 연수생",
  "Freelancer - Grupo Fratelli": "프리랜서 - 그룹 프라텔리",
  "Computer Science BS - UERJ": "컴퓨터 과학 학사 - UERJ",
  "IT Techinical Education - IEPB": "IT 기술 교육 - IEPB",
  "Communication: How to express yourself effectively and be understood": "소통: 효과적으로 표현하고 이해받는 방법",
  "Oratory 1": "웅변 1",
  "Oratory 2": "웅변 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Java 단위 테스트 - JUnit, Mockito 및 TDD",
  "Vim Masterclass": "Vim 마스터 클래스",
  "Cisco CCNA": "시스코 CCNA",
  "Domain Driven Design": "도메인 주도 설계",
  "Java Persistence API and Hibernate": "Java 영속성 API 및 하이버네이트",
  "Python 3 Basics": "Python 3 기초",
  "Languages": "프로그래밍 언어",
  "Experiences": "경험",
  "Certifications": "자격증",
  "Projects": "프로젝트",
  "Made with": "만들기",
  "by Lucas Morais": "Lucas Morais 가 만듦",
  "About": "소개",
  "Educations": "교육",
  "Time worked": "작업 시간",
  "Now": "지금",
  "hours worked": "근무 시간",
  "Brazil": "브라질",
  "United States of America": "미국",
  "France": "프랑스",
  "Spain": "스페인",
  "South Korea": "대한민국",
  "Japan": "일본",
  "Germany": "독일",
  "Italy": "이탈리아",
  "China": "중국",
  "Saudi Arabia": "사우디 아라비아",
  "Portuguese": "포르투갈어",
  "English": "영어",
  "French": "프랑스어",
  "Spanish": "스페인어",
  "Korean": "한국어",
  "Japanese": "일본어",
  "German": "독일어",
  "Italian": "이탈리아어",
  "Chinese": "중국어",
  "Arabic": "아랍어",
  "year": "년",
  "years": "년",
  "month": "개월",
  "months": "개월",
  "day": "일",
  "days": "일",
  "High School": "고등 학교",
  "Instituto de Educação Pereira Batista": "Pereira Batista 교육 연구소",
  "Colégio Casimiro de Abreu": "Casimiro de Abreu 대학",
  "Primary School": "초등학교",
  "Centro Educacional Vilar Novo": "Vilar Novo 교육 센터",
  "Fundação Pestalozzi": "Pestalozzi 재단",
  "Colégio Soberano": "Soberano 대학",
  "Java Multithreading Concurrency Performance Optimization": "자바 멀티스레딩, 동시성 및 성능 최적화",
  "Learn Rust By Building Real Applications": "실제 애플리케이션을 구축하여 Rust 배우기",
  "**Common Data Framework (CoDaF)**: I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\n**CoDaF Wells and Rigs**: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\n**Atria**: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\n**License Manager**: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\n**Rig State**: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "**Common Data Framework (CoDaF)**: 나는 공통 데이터의 지속성을 위한 내부 프레임워크의 기능을 유지하고 향상시키는 주요 기술 리더 중 한 명이 되었으며, 다양한 프로젝트를 위한 중앙 집중식 기반을 만들었습니다.\n\n**CoDaF Wells and Rigs**: 전문가들과 인터뷰를 진행하고 석유 및 가스 솔루션을 위한 일반 용도의 데이터베이스를 모델링하여 약 100개의 엔터티를 생성했습니다.\n\n**Atria**: 여러 안테나의 무결성 상태와 관련된 실시간 머신 러닝 처리 데이터를 통합하는 파일럿 프로젝트를 기술적으로 이끌고 구현했습니다.\n\n**License Manager**: 계약된 라이센스에 따라 클라이언트의 제품(플러그인)에 대한 접근을 제어 및 모니터링하는 License Manager 프로젝트를 설계하고 범위를 정의했으며 구현했습니다. 내장된 환경에서 솔루션의 오용을 방지하고, 책임자들에게 고급 기능을 설명하는 프레젠테이션을 준비했습니다.\n\n**Rig State**: 적절한 문서가 없는 애플리케이션에 대해 리버스 엔지니어링을 수행하여 구현된 비즈니스 규칙에 대한 더 큰 명확성을 제공하고 필요한 수정을 진행할 수 있도록 했습니다.",
  "**Sequence Builder + Cost Tracker**: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\n**Dynamic Risk Advisor (DRA)**: I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "**Sequence Builder + Cost Tracker**: 나는 Sequence Builder 개발에 주요 기여자 중 한 명이었으며, 이 시스템은 역사적 데이터를 기반으로 한 시간 추정값을 포함하는 작업 시퀀스를 생성합니다. 동시에, 시뮬레이션 동안 각 작업의 비용 추정치를 추가하는 Cost Tracker가 개발되었습니다. 또한, 실제 데이터를 기반으로 이러한 작업을 업데이트하고 모니터링할 수 있으며, 계획된 것과 실행된 것을 비교할 수 있습니다.\n\n**Dynamic Risk Advisor (DRA)**: DRA 프로젝트 개발에 일시적으로 참여했으며, 사용자가 실시간으로 장벽과 경고를 관리하고 모니터링할 수 있는 도구를 제공했습니다. 이 도구는 최적화된 운영 리스크 관리를 목표로 합니다.",
  "**Campaign Planner:** Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\n**PDF Extractor:** Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "**Campaign Planner:** 석유 및 가스 운영 캠페인 관리 애플리케이션의 새로운 기능 개발, 유지보수 및 레거시 브라우저와의 호환성에 기여했습니다.\n\n**PDF Extractor:** OCR을 사용하여 다양한 PDF 파일을 특정 CSV 형식으로 변환하는 스크립트를 구현하고, 연구 팀이 기계 학습 모델을 위한 구조화된 데이터를 얻을 수 있도록 지원했습니다."
}
