{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Desarrollador full-stack centrado en resultados, con sólidas habilidades en optimización de rendimiento y eficiencia. Comprometido a ofrecer soluciones pragmáticas que satisfagan las necesidades del cliente con ética y responsabilidad.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "En los últimos años, mi trayectoria en el desarrollo ha estado marcada por una narrativa desafiante, llena de logros y aprendizajes significativos. Cuando me embarqué en este viaje, me enfrenté a una curva de aprendizaje pronunciada, adentrándome en las complejidades tanto del front-end como del back-end. Cada línea de código era un logro, y cada desafío era una oportunidad de crecimiento. Diseñar interfaces intuitivas y diseñar soluciones robustas se convirtió en mi mantra diario.\n\nSin embargo, la verdadera esencia del desarrollo va más allá del código. Me encontré constantemente desafiado a traducir las necesidades del cliente en soluciones tangibles. Además, la importancia de la seguridad de los datos y el respeto a la privacidad del usuario se convirtieron en aspectos integrales de mi trabajo diario.\n\nEstos años en desarrollo no son solo un capítulo sino el fundamento de lo que está por venir. Estoy emocionado de abrazar futuras oportunidades, aplicar los conocimientos adquiridos y contribuir a dar forma al paisaje tecnológico en constante evolución.",
  "Intelie by Viasat": "Intelie por Viasat",
  "Mid-level Software Developer": "Desarrollador de software de nivel intermedio",
  "Junior Software Developer": "Desarrollador de software junior",
  "Software Developer Trainee": "Becario de desarrollador de software",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Licenciatura en Ciencias de la Computación - UERJ",
  "IT Techinical Education - IEPB": "Educación técnica en informática - IEPB",
  "Communication: How to express yourself effectively and be understood": "Comunicación: Cómo expresarse de manera efectiva y ser entendido",
  "Oratory 1": "Oratoria 1",
  "Oratory 2": "Oratoria 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Pruebas unitarias en Java - JUnit, Mockito y TDD",
  "Vim Masterclass": "Masterclass de Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Diseño impulsado por dominios",
  "Java Persistence API and Hibernate": "API de persistencia de Java y Hibernate",
  "Python 3 Basics": "Conceptos básicos de Python 3",
  "Languages": "Idiomas",
  "Experiences": "Experiencias",
  "Certifications": "Certificaciones",
  "Projects": "Proyectos",
  "Made with": "Hecho con",
  "by Lucas Morais": "por Lucas Morais",
  "About": "Acerca de",
  "Educations": "Educaciones"
}

