{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with ethical and responsability.": "Desarrollador full-stack centrado en resultados, con sólidas habilidades en optimización de rendimiento y eficiencia. Comprometido a ofrecer soluciones pragmáticas que satisfagan las necesidades del cliente con ética y responsabilidad.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "En los últimos años, mi trayectoria en el desarrollo ha estado marcada por una narrativa desafiante, llena de logros y aprendizajes significativos. Cuando me embarqué en este viaje, me enfrenté a una curva de aprendizaje pronunciada, adentrándome en las complejidades tanto del front-end como del back-end. Cada línea de código era un logro, y cada desafío era una oportunidad de crecimiento. Diseñar interfaces intuitivas y diseñar soluciones robustas se convirtió en mi mantra diario.\n\nSin embargo, la verdadera esencia del desarrollo va más allá del código. Me encontré constantemente desafiado a traducir las necesidades del cliente en soluciones tangibles. Además, la importancia de la seguridad de los datos y el respeto a la privacidad del usuario se convirtieron en aspectos integrales de mi trabajo diario.\n\nEstos años en desarrollo no son solo un capítulo sino el fundamento de lo que está por venir. Estoy emocionado de abrazar futuras oportunidades, aplicar los conocimientos adquiridos y contribuir a dar forma al paisaje tecnológico en constante evolución.",
  "Intelie by Viasat": "Intelie por Viasat",
  "Mid-level Software Developer": "Desarrollador de software de nivel intermedio",
  "Junior Software Developer": "Desarrollador de software junior",
  "Software Developer Trainee": "Becario de desarrollador de software",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Licenciatura en Ciencias de la Computación - UERJ",
  "IT Techinical Education - IEPB": "Educación técnica en informática - IEPB",
  "Communication: How to express yourself effectively and be understood": "Comunicación: Cómo expresarse de manera efectiva y ser entendido",
  "Oratory 1": "Oratoria 1",
  "Oratory 2": "Oratoria 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Pruebas unitarias en Java - JUnit, Mockito y TDD",
  "Vim Masterclass": "Masterclass de Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Diseño impulsado por dominios",
  "Java Persistence API and Hibernate": "API de persistencia de Java y Hibernate",
  "Python 3 Basics": "Conceptos básicos de Python 3",
  "Languages": "Lenguajes",
  "Experiences": "Experiencias",
  "Certifications": "Certificaciones",
  "Projects": "Proyectos",
  "Made with": "Hecho con",
  "by Lucas Morais": "por Lucas Morais",
  "About": "Acerca de",
  "Educations": "Educaciones",
  "Time worked": "Tiempo trabajado",
  "Now": "Ahora",
  "hours worked": "horas trabajadas",
  "Brazil": "Brasil",
  "United States of America": "Estados Unidos",
  "France": "Francia",
  "Spain": "España",
  "South Korea": "Corea del Sur",
  "Japan": "Japón",
  "Germany": "Alemania",
  "Italy": "Italia",
  "China": "China",
  "Saudi Arabia": "Arabia Saudí",
  "Portuguese": "Portugués",
  "English": "Inglés",
  "French": "Francés",
  "Spanish": "Español",
  "Korean": "Coreano",
  "Japanese": "Japonés",
  "German": "Alemán",
  "Italian": "Italiano",
  "Chinese": "Chino",
  "Arabic": "Arábica",
  "year": "año",
  "years": "años",
  "month": "mes",
  "months": "meses",
  "day": "día",
  "days": "días",
  "High School": "Escuela Secundaria",
  "Instituto de Educação Pereira Batista": "Instituto de Educación Pereira Batista",
  "Colégio Casimiro de Abreu": "Colegio Casimiro de Abreu",
  "Primary School": "Escuela Primaria",
  "Centro Educacional Vilar Novo": "Centro Educacional Vilar Novo",
  "Fundação Pestalozzi": "Fundación Pestalozzi",
  "Colégio Soberano": "Colegio Soberano",
  "Java Multithreading Concurrency Performance Optimization": "Java Multithreading, Concurrencia y Optimización del Rendimiento",
  "Learn Rust By Building Real Applications": "Aprende Rust Construyendo Aplicaciones Reales","Common Data Framework (CoDaF): I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\nCoDaF Wells and Rigs: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\nAtria: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\nLicense Manager: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\nRig State: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "Common Data Framework (CoDaF): Me convertí en uno de los principales líderes técnicos responsables de mantener y mejorar las funcionalidades de un marco interno para la persistencia de datos comunes, creando una base centralizada para diferentes proyectos.\n\nCoDaF Wells and Rigs: Entrevisté a especialistas y modelé una base de datos de uso general para soluciones de petróleo y gas, resultando en aproximadamente 100 entidades.\n\nAtria: Lideré técnicamente e implementé un proyecto piloto para integrar el procesamiento de datos en tiempo real de Machine Learning relacionados con el estado de integridad de múltiples antenas.\n\nLicense Manager: Diseñé, alcancé el alcance y implementé el License Manager, un proyecto para controlar y monitorear el acceso de los clientes a productos (plugins) de acuerdo con la licencia contratada, evitando el uso indebido de las soluciones en entornos embebidos. Preparé una presentación explicando la funcionalidad de alto nivel para los responsables.\n\nRig State: Realicé ingeniería inversa en una aplicación sin documentación adecuada para proporcionar mayor claridad a los gestores sobre las reglas de negocio implementadas, permitiendo que las modificaciones necesarias procedieran.",
  "Sequence Builder + Cost Tracker: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\nDynamic Risk Advisor (DRA): I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "Sequence Builder + Cost Tracker: Fui uno de los principales colaboradores en el desarrollo de Sequence Builder, un sistema que genera simulaciones resultando en una secuencia de operaciones con estimaciones de tiempo basadas en datos históricos para planificar las actividades de los pozos de petróleo. Paralelamente, se desarrolló Cost Tracker, que funciona acoplado a Sequence Builder añadiendo estimaciones de costos para cada operación durante la simulación. Además, permite la actualización y el seguimiento de estas operaciones basadas en datos reales, permitiendo comparaciones entre lo planeado y lo ejecutado.\n\nDynamic Risk Advisor (DRA): Participé temporalmente en el desarrollo del proyecto DRA, una herramienta basada en la metodología bowtie, permitiendo al usuario gestionar y monitorear barreras y alertas en tiempo real, con el objetivo de optimizar la gestión de riesgos operacionales.",
  "Campaign Planner: Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\nPDF Extractor: Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "Campaign Planner: Contribuí al desarrollo de nuevas funcionalidades, mantenimiento y compatibilidad con navegadores antiguos en una aplicación de gestión de campañas para operaciones de petróleo y gas.\n\nPDF Extractor: Responsable de implementar un script para convertir diversos archivos PDF en un formato CSV específico usando OCR, asistiendo al equipo de investigación en la obtención de datos estructurados para modelos de aprendizaje automático."
}
