{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Ein Full-Stack-Entwickler, der sich auf Ergebnisse konzentriert, mit starken Fähigkeiten in Leistungsoptimierung und Effizienz. Verpflichtet, pragmatische Lösungen zu liefern, die liefern, was der Kunde mit ethischer Verantwortung und Verantwortung benötigt.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "In den letzten Jahren war meine Entwicklung von einer herausfordernden Erzählung geprägt, die mit Errungenschaften und bedeutenden Lernerfahrungen gefüllt war. Als ich mich auf diese Reise begab, stand ich vor einer steilen Lernkurve und tauchte in die Komplexitäten von Front- und Back-End ein. Jede Codezeile war ein Erfolg und jede Herausforderung eine Wachstumschance. Die Gestaltung intuitiver Schnittstellen und die Entwicklung robuster Lösungen wurden mein tägliches Mantra.\n\nDie wahre Essenz der Entwicklung geht jedoch über den Code hinaus. Ich fand mich ständig herausgefordert, die Bedürfnisse der Kunden in greifbare Lösungen zu übersetzen. Darüber hinaus wurden die Bedeutung der Datensicherheit und der Respekt für die Privatsphäre der Benutzer zu integralen Bestandteilen meiner täglichen Arbeit.\n\nDiese Entwicklungsjahre sind nicht nur ein Kapitel, sondern das Fundament für das, was kommt. Ich freue mich darauf, zukünftige Möglichkeiten zu nutzen, das erlangte Wissen anzuwenden und dazu beizutragen, die sich ständig weiterentwickelnde technologische Landschaft zu gestalten.",
  "Intelie by Viasat": "Intelie von Viasat",
  "Mid-level Software Developer": "Softwareentwickler mittlerer Ebene",
  "Junior Software Developer": "Junior-Softwareentwickler",
  "Software Developer Trainee": "Softwareentwickler-Praktikant",
  "Freelancer - Grupo Fratelli": "Freiberufler - Grupo Fratelli",
  "Computer Science BS - UERJ": "Informatik BS - UERJ",
  "IT Techinical Education - IEPB": "IT-Technische Ausbildung - IEPB",
  "Communication: How to express yourself effectively and be understood": "Kommunikation: Wie man sich effektiv ausdrückt und verstanden wird",
  "Oratory 1": "Redekunst 1",
  "Oratory 2": "Redekunst 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Unit-Tests in Java - JUnit, Mockito und TDD",
  "Vim Masterclass": "Vim-Meisterklasse",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Domänenspezifisches Design",
  "Java Persistence API and Hibernate": "Java Persistence API und Hibernate",
  "Python 3 Basics": "Python 3 Grundlagen",
  "Languages": "Sprachen",
  "Experiences": "Erfahrungen",
  "Certifications": "Zertifizierungen",
  "Projects": "Projekte",
  "Made with": "Hergestellt mit",
  "by Lucas Morais": "von Lucas Morais",
  "About": "Über",
  "Educations": "Ausbildungen",
  "Time worked": "Arbeitszeit",
  "Now": "Jetzt",
  "hours worked": "gearbeitete Stunden",
  "Brazil": "Brasilien",
  "United States of America": "Vereinigte Staaten",
  "France": "Frankreich",
  "Spain": "Spanien",
  "South Korea": "Südkorea",
  "Japan": "Japan",
  "Germany": "Deutschland",
  "Italy": "Italien",
  "China": "China",
  "Saudi Arabia": "Saudi-Arabien",
  "Portuguese": "Portugiesisch",
  "English": "Englisch",
  "French": "Französisch",
  "Spanish": "Spanisch",
  "Korean": "Koreanisch",
  "Japanese": "Japanisch",
  "German": "Deutsch",
  "Italian": "Italienisch",
  "Chinese": "Chinesisch",
  "Arabic": "Arabisch"
}