{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with ethical and responsability.": "Ein Full-Stack-Entwickler, der sich auf Ergebnisse konzentriert, mit starken Fähigkeiten in Leistungsoptimierung und Effizienz. Verpflichtet, pragmatische Lösungen zu liefern, die liefern, was der Kunde mit ethischer Verantwortung und Verantwortung benötigt.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "In den letzten Jahren war meine Entwicklung von einer herausfordernden Erzählung geprägt, die mit Errungenschaften und bedeutenden Lernerfahrungen gefüllt war. Als ich mich auf diese Reise begab, stand ich vor einer steilen Lernkurve und tauchte in die Komplexitäten von Front- und Back-End ein. Jede Codezeile war ein Erfolg und jede Herausforderung eine Wachstumschance. Die Gestaltung intuitiver Schnittstellen und die Entwicklung robuster Lösungen wurden mein tägliches Mantra.\n\nDie wahre Essenz der Entwicklung geht jedoch über den Code hinaus. Ich fand mich ständig herausgefordert, die Bedürfnisse der Kunden in greifbare Lösungen zu übersetzen. Darüber hinaus wurden die Bedeutung der Datensicherheit und der Respekt für die Privatsphäre der Benutzer zu integralen Bestandteilen meiner täglichen Arbeit.\n\nDiese Entwicklungsjahre sind nicht nur ein Kapitel, sondern das Fundament für das, was kommt. Ich freue mich darauf, zukünftige Möglichkeiten zu nutzen, das erlangte Wissen anzuwenden und dazu beizutragen, die sich ständig weiterentwickelnde technologische Landschaft zu gestalten.",
  "Intelie by Viasat": "Intelie von Viasat",
  "Mid-level Software Developer": "Softwareentwickler mittlerer Ebene",
  "Junior Software Developer": "Junior-Softwareentwickler",
  "Software Developer Trainee": "Softwareentwickler-Praktikant",
  "Freelancer - Grupo Fratelli": "Freiberufler - Grupo Fratelli",
  "Computer Science BS - UERJ": "Informatik BS - UERJ",
  "IT Techinical Education - IEPB": "IT-Technische Ausbildung - IEPB",
  "Communication: How to express yourself effectively and be understood": "Kommunikation: Wie man sich effektiv ausdrückt und verstanden wird",
  "Oratory 1": "Redekunst 1",
  "Oratory 2": "Redekunst 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Unit-Tests in Java - JUnit, Mockito und TDD",
  "Vim Masterclass": "Vim-Meisterklasse",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Domänenspezifisches Design",
  "Java Persistence API and Hibernate": "Java Persistence API und Hibernate",
  "Python 3 Basics": "Python 3 Grundlagen",
  "Languages": "Sprachen",
  "Experiences": "Erfahrungen",
  "Certifications": "Zertifizierungen",
  "Projects": "Projekte",
  "Made with": "Hergestellt mit",
  "by Lucas Morais": "von Lucas Morais",
  "About": "Über",
  "Educations": "Ausbildungen",
  "Time worked": "Arbeitszeit",
  "Now": "Jetzt",
  "hours worked": "gearbeitete Stunden",
  "Brazil": "Brasilien",
  "United States of America": "Vereinigte Staaten",
  "France": "Frankreich",
  "Spain": "Spanien",
  "South Korea": "Südkorea",
  "Japan": "Japan",
  "Germany": "Deutschland",
  "Italy": "Italien",
  "China": "China",
  "Saudi Arabia": "Saudi-Arabien",
  "Portuguese": "Portugiesisch",
  "English": "Englisch",
  "French": "Französisch",
  "Spanish": "Spanisch",
  "Korean": "Koreanisch",
  "Japanese": "Japanisch",
  "German": "Deutsch",
  "Italian": "Italienisch",
  "Chinese": "Chinesisch",
  "Arabic": "Arabisch",
  "year": "Jahr",
  "years": "Jahre",
  "month": "Monat",
  "months": "Monate",
  "day": "Tag",
  "days": "Tage",
  "High School": "Gymnasium",
  "Instituto de Educação Pereira Batista": "Institut für Bildung Pereira Batista",
  "Colégio Casimiro de Abreu": "Colégio Casimiro de Abreu",
  "Primary School": "Grundschule",
  "Centro Educacional Vilar Novo": "Bildungszentrum Vilar Novo",
  "Fundação Pestalozzi": "Pestalozzi Stiftung",
  "Colégio Soberano": "Colégio Soberano",
  "Java Multithreading Concurrency Performance Optimization": "Java Multithreading, Parallelität und Leistungsoptimierung",
  "Learn Rust By Building Real Applications": "Lerne Rust durch den Bau realer Anwendungen",
  "Common Data Framework (CoDaF): I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\nCoDaF Wells and Rigs: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\nAtria: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\nLicense Manager: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\nRig State: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "Common Data Framework (CoDaF): Ich wurde einer der Haupttechnischen Leiter, die für die Wartung und Verbesserung der Funktionen eines internen Rahmens zur Persistenz gemeinsamer Daten verantwortlich sind und eine zentrale Basis für verschiedene Projekte schaffen.\n\nCoDaF Wells and Rigs: Ich interviewte Spezialisten und modellierte eine allgemein verwendbare Datenbank für Öl- und Gaslösungen, die etwa 100 Entitäten umfasste.\n\nAtria: Ich leitete technisch und implementierte ein Pilotprojekt zur Integration von Echtzeit-Maschinenlernverarbeitungsdaten im Zusammenhang mit dem Integritätsstatus mehrerer Antennen.\n\nLicense Manager: Ich entwarf, definierte den Umfang und implementierte den License Manager, ein Projekt zur Steuerung und Überwachung des Zugriffs von Kunden auf Produkte (Plugins) gemäß der vertraglichen Lizenz, um Missbrauch der Lösungen in eingebetteten Umgebungen zu verhindern. Ich bereitete eine Präsentation vor, die die Funktionalität auf hoher Ebene für die verantwortlichen Manager erklärte.\n\nRig State: Ich führte Reverse Engineering an einer Anwendung ohne angemessene Dokumentation durch, um den Managern eine bessere Klarheit über die implementierten Geschäftsregeln zu verschaffen, damit die erforderlichen Änderungen vorgenommen werden konnten.",
  "Sequence Builder + Cost Tracker: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\nDynamic Risk Advisor (DRA): I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "Sequence Builder + Cost Tracker: Ich gehörte zu den Hauptbeiträgern der Entwicklung von Sequence Builder, einem System, das Simulationen erstellt, die in eine Abfolge von Operationen mit Zeitabschätzungen auf Basis historischer Daten für die Planung von Ölbohraktivitäten führen. Parallel dazu wurde Cost Tracker entwickelt, das zusammen mit Sequence Builder arbeitet, indem es Kostenschätzungen für jede Operation während der Simulation hinzufügt. Außerdem ermöglicht es das Aktualisieren und Überwachen dieser Operationen auf Basis von Echtzeitdaten, wodurch Vergleiche zwischen den geplanten und den durchgeführten Aktivitäten ermöglicht werden.\n\nDynamic Risk Advisor (DRA): Ich nahm vorübergehend an der Entwicklung des DRA-Projekts teil, einem Werkzeug, das auf der Bowtie-Methode basiert und es dem Benutzer ermöglicht, Barrieren und Warnungen in Echtzeit zu verwalten und zu überwachen, um eine optimierte Betriebsrisikomanagement zu erreichen.",
  "Campaign Planner: Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\nPDF Extractor: Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "Campaign Planner: Beteiligte mich an der Entwicklung neuer Funktionen, Wartung und Kompatibilität mit älteren Browsern in einer Anwendung zur Kampagnenverwaltung für Öl- und Gasoperationen.\n\nPDF Extractor: Verantwortlich für die Implementierung eines Skripts zur Umwandlung verschiedener PDF-Dateien in ein bestimmtes CSV-Format unter Verwendung von OCR, um dem Forschungsteam zu helfen, strukturierte Daten für maschinelle Lernmodelle zu erhalten."
}
