{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "一名专注于结果的全栈开发人员，具有优化性能和效率的强大技能。致力于提供实用解决方案，以符合道德和责任的客户需求。",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "近年来，我的发展之旅充满了挑战性的叙事，充满了成就和重要的学习经验。当我踏上这个旅程时，我面临着陡峭的学习曲线，深入研究前端和后端的复杂性。每一行代码都是一个成就，每一个挑战都是一个成长的机会。打造直观的界面和设计强大的解决方案成为了我的日常口头禅。\n\n然而，开发的真正精髓不仅仅在于代码。我发现自己始终面临着将客户需求转化为具体解决方案的挑战。此外，数据安全的重要性和对用户隐私的尊重成为了我的日常工作的核心方面。\n\n这些年来的发展不仅仅是一个章节，而是未来发展的基础。我很高兴能够拥抱未来的机遇，应用所学知识，并为塑造不断发展的技术景观做出贡献。",
  "Intelie by Viasat": "Intelie by Viasat",
  "Mid-level Software Developer": "中级软件开发人员",
  "Junior Software Developer": "初级软件开发人员",
  "Software Developer Trainee": "软件开发实习生",
  "Freelancer - Grupo Fratelli": "自由职业者 - Grupo Fratelli",
  "Computer Science BS - UERJ": "计算机科学 - UERJ",
  "IT Techinical Education - IEPB": "IT技术教育 - IEPB",
  "Communication: How to express yourself effectively and be understood": "沟通：如何有效表达自己并被理解",
  "Oratory 1": "演讲1",
  "Oratory 2": "演讲2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Java单元测试 - JUnit，Mockito和TDD",
  "Vim Masterclass": "Vim大师课程",
  "Cisco CCNA": "思科CCNA",
  "Domain Driven Design": "领域驱动设计",
  "Java Persistence API and Hibernate": "Java持久性API和Hibernate",
  "Python 3 Basics": "Python 3基础",
  "Languages": "编程语言",
  "Experiences": "经验",
  "Certifications": "认证",
  "Projects": "项目",
  "Made with": "制作",
  "About": "关于",
  "by Lucas Morais": "作者：Lucas Morais",
  "Educations": "教育",
  "Time worked": "工作时间",
  "Now": "现在",
  "hours worked": "工作时间",
  "Brazil": "巴西",
  "United States of America": "美国",
  "France": "法国",
  "Spain": "西班牙",
  "South Korea": "韩国",
  "Japan": "日本",
  "Germany": "德国",
  "Italy": "意大利",
  "China": "中国",
  "Saudi Arabia": "沙特阿拉伯",
  "Portuguese": "葡萄牙语",
  "English": "英语",
  "French": "法语",
  "Spanish": "西班牙语",
  "Korean": "韩语",
  "Japanese": "日语",
  "German": "德语",
  "Italian": "意大利语",
  "Chinese": "中文",
  "Arabic": "阿拉伯语",
  "year": "年",
  "years": "年",
  "month": "个月",
  "months": "个月",
  "day": "天",
  "days": "天",
  "High School": "高中",
  "Instituto de Educação Pereira Batista": "佩雷拉·巴蒂斯塔教育学院",
  "Colégio Casimiro de Abreu": "卡西米罗·德·阿布雷乌学院",
  "Primary School": "小学",
  "Centro Educacional Vilar Novo": "维拉尔诺沃教育中心",
  "Fundação Pestalozzi": "佩斯塔洛齐基金会",
  "Colégio Soberano": "索贝拉诺学院",
  "Java Multithreading Concurrency Performance Optimization": "Java 多线程、并发性和性能优化",
  "Learn Rust By Building Real Applications": "通过构建真实应用学习 Rust",
  "**Common Data Framework (CoDaF)**: I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\n**CoDaF Wells and Rigs**: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\n**Atria**: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\n**License Manager**: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\n**Rig State**: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "**Common Data Framework (CoDaF)**: 我成为了负责维护和增强内部框架功能的主要技术领导者之一，该框架用于持久化公共数据，为不同项目创建了一个集中式基础。\n\n**CoDaF Wells and Rigs**: 我采访了专家，并为石油和天然气解决方案建模了一个通用数据库，结果形成了大约100个实体。\n\n**Atria**: 我在技术上领导并实施了一个试点项目，以集成实时机器学习处理与多个天线的完整性状态相关的数据。\n\n**License Manager**: 我设计、定义范围并实施了License Manager项目，该项目用于根据合同许可证控制和监控客户对产品（插件）的访问，防止在嵌入式环境中对解决方案的滥用。我准备了一份演示文稿，向相关经理解释了高层次的功能。\n\n**Rig State**: 我对一个没有适当文档的应用程序进行了逆向工程，以便向经理提供有关已实施的业务规则的更大清晰度，从而允许进行必要的修改。",
  "**Sequence Builder + Cost Tracker**: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\n**Dynamic Risk Advisor (DRA)**: I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "**Sequence Builder + Cost Tracker**: 我是Sequence Builder开发的主要贡献者之一，该系统生成模拟结果，并根据历史数据生成操作序列和时间估算。与此同时，还开发了Cost Tracker，它与Sequence Builder配合，通过在模拟过程中为每个操作添加成本估算来工作。此外，它允许基于实际数据更新和监控这些操作，从而实现计划和实际执行之间的比较。\n\n**Dynamic Risk Advisor (DRA)**: 我暂时参与了DRA项目的开发，这是一种基于bowtie方法论的工具，允许用户实时管理和监控障碍和警报，旨在优化操作风险管理。",
  "**Campaign Planner:** Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\n**PDF Extractor:** Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "**Campaign Planner:** 参与了石油和天然气运营管理应用程序中新功能的开发、维护和与旧版浏览器的兼容性。\n\n**PDF Extractor:** 负责实现一个脚本，将各种PDF文件转换为特定的CSV格式，使用OCR技术，帮助研究团队获得用于机器学习模型的结构化数据。"
}