{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Un sviluppatore full-stack focalizzato sui risultati, con solide competenze nell'ottimizzazione delle prestazioni e nell'efficienza. Impegnato a fornire soluzioni pragmatiche che soddisfano ciò di cui il cliente ha bisogno con etica e responsabilità.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "Negli ultimi anni, il mio percorso nello sviluppo è stato segnato da una narrazione stimolante, ricca di successi e significativi apprendimenti. Quando mi sono imbarcato in questo viaggio, ho affrontato una ripida curva di apprendimento, approfondendo le complessità sia del front-end che del back-end. Ogni riga di codice era un traguardo, e ogni sfida era un'opportunità di crescita. Creare interfacce intuitive e progettare soluzioni robuste è diventato il mio mantra quotidiano.\n\nTuttavia, la vera essenza dello sviluppo va oltre il codice. Mi sono trovato costantemente sfidato a tradurre le esigenze dei clienti in soluzioni tangibili. Inoltre, l'importanza della sicurezza dei dati e il rispetto della privacy dell'utente sono diventati aspetti integrali del mio lavoro quotidiano.\n\nQuesti anni nello sviluppo non sono solo un capitolo, ma il fondamento di ciò che ci attende. Sono entusiasta di abbracciare future opportunità, applicare le conoscenze acquisite e contribuire a plasmare il paesaggio tecnologico in continua evoluzione.",
  "Intelie by Viasat": "Intelie di Viasat",
  "Mid-level Software Developer": "Sviluppatore software di livello medio",
  "Junior Software Developer": "Sviluppatore software junior",
  "Software Developer Trainee": "Stagista sviluppatore software",
  "Freelancer - Grupo Fratelli": "Libero professionista - Grupo Fratelli",
  "Computer Science BS - UERJ": "Laurea in informatica - UERJ",
  "IT Techinical Education - IEPB": "Educazione tecnica IT - IEPB",
  "Communication: How to express yourself effectively and be understood": "Comunicazione: come esprimersi efficacemente e farsi capire",
  "Oratory 1": "Oratoria 1",
  "Oratory 2": "Oratoria 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Test di unità in Java - JUnit, Mockito e TDD",
  "Vim Masterclass": "Vim Masterclass",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Design orientato al dominio",
  "Java Persistence API and Hibernate": "API di persistenza Java e Hibernate",
  "Python 3 Basics": "Python 3 Basico",
  "Languages": "Linguaggi di programmazione",
  "Experiences": "Esperienze",
  "Certifications": "Certificazioni",
  "Projects": "Progetti",
  "Made with": "Realizzato con",
  "by Lucas Morais": "di Lucas Morais",
  "About": "Informazioni",
  "Educations": "Educazioni",
  "Time worked": "Tempo lavorato",
  "Now": "Adesso",
  "hours worked": "ore lavorate",
  "Brazil": "Brasile",
  "United States": "Stati Uniti",
  "France": "Francia",
  "Spain": "Spagna",
  "South Korea": "Corea del Sud",
  "Japan": "Giappone",
  "Germany": "Germania",
  "Italy": "Italia",
  "China": "Cina",
  "Saudi Arabia": "Arabia Saudita"
}

