{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Um desenvolvedor full-stack focado em resultados, com habilidades sólidas em otimização de desempenho e eficiência. Comprometido em fornecer soluções pragmáticas que entregam o que o cliente precisa com ética e responsabilidade.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "Nos últimos anos, minha jornada no desenvolvimento foi marcada por uma narrativa desafiadora, repleta de conquistas e aprendizados significativos. Quando embarquei nesta jornada, enfrentei uma curva de aprendizado íngreme, mergulhando nas complexidades tanto do front-end quanto do back-end. Cada linha de código foi uma conquista, e cada desafio foi uma oportunidade de crescimento. Criar interfaces intuitivas e projetar soluções robustas se tornou meu mantra diário.\n\nNo entanto, a verdadeira essência do desenvolvimento vai além do código. Encontrei-me constantemente desafiado a traduzir as necessidades dos clientes em soluções tangíveis. Além disso, a importância da segurança de dados e do respeito à privacidade do usuário tornou-se aspectos integrais do meu trabalho diário.\n\nEsses anos de desenvolvimento não são apenas um capítulo, mas a base para o que está por vir. Estou animado para abraçar futuras oportunidades, aplicar o conhecimento adquirido e contribuir para moldar o cenário tecnológico em constante evolução.",
  "Intelie by Viasat": "Intelie pela Viasat",
  "Mid-level Software Developer": "Desenvolvedor de Software Pleno",
  "Junior Software Developer": "Desenvolvedor de Software Júnior",
  "Software Developer Trainee": "Estagiário de Desenvolvimento de Software",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Bacharelado em Ciência da Computação - UERJ",
  "IT Techinical Education - IEPB": "Educação Técnica em TI - IEPB",
  "Communication: How to express yourself effectively and be understood": "Comunicação: Como se expressar de forma eficaz e ser compreendido",
  "Oratory 1": "Oratória 1",
  "Oratory 2": "Oratória 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Testes Unitários em Java - JUnit, Mockito e TDD",
  "Vim Masterclass": "Masterclass de Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Design Orientado a Domínio",
  "Java Persistence API and Hibernate": "API de Persistência Java e Hibernate",
  "Python 3 Basics": "Fundamentos de Python 3",
  "Languages": "Linguagens",
  "Experiences": "Experiências",
  "About": "Sobre",
  "Certifications": "Certificações",
  "Projects": "Projetos",
  "Made with": "Feito com",
  "by Lucas Morais": "por Lucas Morais",
  "Educations": "Educações",
  "Time worked": "Tempo trabalhado",
  "Now": "Agora",
  "hours worked": "horas trabalhadas",
  "Brazil": "Brasil",
  "United States": "Estados Unidos",
  "France": "França",
  "Spain": "Espanha",
  "South Korea": "Coreia do Sul",
  "Japan": "Japão",
  "Germany": "Alemanha",
  "Italy": "Itália",
  "China": "China",
  "Saudi Arabia": "Arábia Saudita"
}