{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "Um desenvolvedor full-stack focado em resultados, com habilidades sólidas em otimização de desempenho e eficiência. Comprometido em fornecer soluções pragmáticas que entregam o que o cliente precisa com ética e responsabilidade.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "Nos últimos anos, minha jornada no desenvolvimento foi marcada por uma narrativa desafiadora, repleta de conquistas e aprendizados significativos. Quando embarquei nesta jornada, enfrentei uma curva de aprendizado íngreme, mergulhando nas complexidades tanto do front-end quanto do back-end. Cada linha de código foi uma conquista, e cada desafio foi uma oportunidade de crescimento. Criar interfaces intuitivas e projetar soluções robustas se tornou meu mantra diário.\n\nNo entanto, a verdadeira essência do desenvolvimento vai além do código. Encontrei-me constantemente desafiado a traduzir as necessidades dos clientes em soluções tangíveis. Além disso, a importância da segurança de dados e do respeito à privacidade do usuário tornou-se aspectos integrais do meu trabalho diário.\n\nEsses anos de desenvolvimento não são apenas um capítulo, mas a base para o que está por vir. Estou animado para abraçar futuras oportunidades, aplicar o conhecimento adquirido e contribuir para moldar o cenário tecnológico em constante evolução.",
  "Intelie by Viasat": "Intelie pela Viasat",
  "Mid-level Software Developer": "Desenvolvedor de Software Pleno",
  "Junior Software Developer": "Desenvolvedor de Software Júnior",
  "Software Developer Trainee": "Estagiário de Desenvolvimento de Software",
  "Freelancer - Grupo Fratelli": "Freelancer - Grupo Fratelli",
  "Computer Science BS - UERJ": "Bacharelado em Ciência da Computação - UERJ",
  "IT Techinical Education - IEPB": "Educação Técnica em TI - IEPB",
  "Communication: How to express yourself effectively and be understood": "Comunicação: Como se expressar de forma eficaz e ser compreendido",
  "Oratory 1": "Oratória 1",
  "Oratory 2": "Oratória 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Testes Unitários em Java - JUnit, Mockito e TDD",
  "Vim Masterclass": "Masterclass de Vim",
  "Cisco CCNA": "Cisco CCNA",
  "Domain Driven Design": "Design Orientado a Domínio",
  "Java Persistence API and Hibernate": "API de Persistência Java e Hibernate",
  "Python 3 Basics": "Fundamentos de Python 3",
  "Languages": "Linguagens",
  "Experiences": "Experiências",
  "About": "Sobre",
  "Certifications": "Certificações",
  "Projects": "Projetos",
  "Made with": "Feito com",
  "by Lucas Morais": "por Lucas Morais",
  "Educations": "Educações",
  "Time worked": "Tempo trabalhado",
  "Now": "Agora",
  "hours worked": "horas trabalhadas",
  "Brazil": "Brasil",
  "United States of America": "Estados Unidos",
  "France": "França",
  "Spain": "Espanha",
  "South Korea": "Coreia do Sul",
  "Japan": "Japão",
  "Germany": "Alemanha",
  "Italy": "Itália",
  "China": "China",
  "Saudi Arabia": "Arábia Saudita",
  "Portuguese": "Português",
  "English": "Inglês",
  "French": "Francês",
  "Spanish": "Espanhol",
  "Korean": "Coreano",
  "Japanese": "Japonês",
  "German": "Alemão",
  "Italian": "Italiano",
  "Chinese": "Chinês",
  "Arabic": "Árabe",
  "year": "ano",
  "years": "anos",
  "month": "mês",
  "months": "meses",
  "day": "dia",
  "days": "dias",
  "High School": "Ensino Médio",
  "Instituto de Educação Pereira Batista": "Instituto de Educação Pereira Batista",
  "Colégio Casimiro de Abreu": "Colégio Casimiro de Abreu",
  "Primary School": "Ensino Fundamental",
  "Centro Educacional Vilar Novo": "Centro Educacional Vilar Novo",
  "Fundação Pestalozzi": "Fundação Pestalozzi",
  "Colégio Soberano": "Colégio Soberano",
  "Java Multithreading Concurrency Performance Optimization": "Java Multithreading, Concorrência e Otimização de Desempenho",
  "Learn Rust By Building Real Applications": "Aprenda Rust Construindo Aplicações Reais",
  "**Common Data Framework (CoDaF)**: I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\n**CoDaF Wells and Rigs**: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\n**Atria**: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\n**License Manager**: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\n**Rig State**: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "**Common Data Framework (CoDaF)**: Tornei-me um dos principais líderes técnicos responsáveis por manter e aprimorar funcionalidades de um framework interno para a persistência de dados comuns, criando uma base centralizada para diferentes projetos.\n\n**CoDaF Wells and Rigs**: Entrevistou especialistas e modelou um banco de dados de uso geral para soluções de petróleo e gás, resultando em aproximadamente 100 entidades.\n\n**Atria**: Liderou tecnicamente e implementou um projeto piloto para integrar o processamento de Machine Learning em tempo real de dados relacionados ao status de integridade de múltiplas antenas.\n\n**License Manager**: Arquitetou, planejou e implementou o License Manager, um projeto para controlar e monitorar o acesso dos clientes aos produtos (plugins) de acordo com a licença contratada, prevenindo o uso indevido das soluções em ambientes embarcados. Preparou uma apresentação explicando a funcionalidade de alto nível para os gestores responsáveis.\n\n**Rig State**: Realizou engenharia reversa em uma aplicação sem documentação adequada para fornecer maior clareza aos gestores sobre as regras de negócios implementadas, permitindo que as modificações necessárias prosseguissem.",
  "**Sequence Builder + Cost Tracker**: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\n**Dynamic Risk Advisor (DRA)**: I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "**Sequence Builder + Cost Tracker**: Fui um dos principais colaboradores no desenvolvimento do Sequence Builder, um sistema que gera simulações resultando em uma sequência de operações com estimativas de tempo baseadas em dados históricos para o planejamento de atividades de poços de petróleo. Paralelamente, houve o desenvolvimento do Cost Tracker, que funciona acoplado ao Sequence Builder, adicionando estimativas de custo para cada operação durante a simulação. Além disso, permite a atualização e monitoramento dessas operações com base em dados reais, possibilitando comparações entre o planejado e o executado.\n\n**Dynamic Risk Advisor (DRA)**: Participei temporariamente do desenvolvimento do projeto DRA, uma ferramenta baseada na metodologia bowtie, permitindo ao usuário gerenciar e monitorar barreiras e alertas em tempo real, visando uma gestão otimizada de risco operacional.",
  "**Campaign Planner:** Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\n**PDF Extractor:** Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "**Campaign Planner:** Contribuiu para o desenvolvimento de novas funcionalidades, manutenção e compatibilidade com navegadores legados em uma aplicação de gestão de campanhas de operações de petróleo e gás.\n\n**PDF Extractor:** Responsável por implementar um script para converter diversos arquivos PDF em um formato CSV específico usando OCR, auxiliando a equipe de pesquisa na obtenção de dados estruturados para modelos de aprendizado de máquina."
}