{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "مطور برمجيات كامل الشريحة متخصص في تحقيق النتائج، مع مهارات قوية في تحسين الأداء والكفاءة. ملتزم بتقديم حلول عملية تلبي احتياجات العميل بأمانة ومسؤولية.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "في السنوات الأخيرة، كانت رحلتي في التطوير مميزة بسرد تحدي واعترافات وتعلمات هامة. عندما بدأت في هذه الرحلة، واجهت منحنى تعلم حادًا، حيث استكشفت تعقيدات كل من الواجهة الأمامية والخلفية. كل سطر من الشفرة كان إنجازًا، وكل تحدي كان فرصة للنمو. أصبح صنع واجهات بديهية وتصميم حلول قوية جزءًا من يومياتي.\n\nومع ذلك، فإن جوهر التطوير يتجاوز الشفرة. وجدت نفسي دائمًا متحديًا لترجمة احتياجات العملاء إلى حلول ملموسة. بالإضافة إلى ذلك، أصبح أمن البيانات واحترام خصوصية المستخدم جزءًا أساسيًا من عملي اليومي.\n\nهذه السنوات في التطوير ليست مجرد فصل واحد بل هي الأساس لما يأتي. أنا متحمس لاستغلال الفرص المستقبلية، وتطبيق المعرفة المكتسبة، والمساهمة في تشكيل المشهد التكنولوجي المتطور باستمرار.",
  "Intelie by Viasat": "Intelie بواسطة Viasat",
  "Mid-level Software Developer": "مطور برمجيات متوسط المستوى",
  "Junior Software Developer": "مطور برمجيات مبتدئ",
  "Software Developer Trainee": "متدرب مطور برمجيات",
  "Freelancer - Grupo Fratelli": "عمل حر - مجموعة Fratelli",
  "Computer Science BS - UERJ": "علوم الحاسوب - جامعة UERJ",
  "IT Techinical Education - IEPB": "تعليم تقني لتقنية المعلومات - IEPB",
  "Communication: How to express yourself effectively and be understood": "الاتصال: كيفية التعبير عن نفسك بفعالية والفهم",
  "Oratory 1": "الخطاب 1",
  "Oratory 2": "الخطاب 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "اختبارات الوحدة في جافا - JUnit، Mockito و TDD",
  "Vim Masterclass": "دورة ماجستير Vim",
  "Cisco CCNA": "سيسكو CCNA",
  "Domain Driven Design": "تصميم مدفوع بالنطاق",
  "Java Persistence API and Hibernate": "واجهة برمجة تطبيقات جافا للبقاء والهيبيرنيت",
  "Python 3 Basics": "أساسيات Python 3",
  "Languages": "اللغات",
  "Experiences": "تجارب",
  "Certifications": "الشهادات",
  "Projects": "مشاريع",
  "Made with": "صنع بواسطة",
  "by Lucas Morais": "بواسطة Lucas Morais",
  "About": "حول",
  "Educations": "تعليم"
}