{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "مطور برمجيات كامل الشريحة متخصص في تحقيق النتائج، مع مهارات قوية في تحسين الأداء والكفاءة. ملتزم بتقديم حلول عملية تلبي احتياجات العميل بأمانة ومسؤولية.",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "في السنوات الأخيرة، كانت رحلتي في التطوير مميزة بسرد تحدي واعترافات وتعلمات هامة. عندما بدأت في هذه الرحلة، واجهت منحنى تعلم حادًا، حيث استكشفت تعقيدات كل من الواجهة الأمامية والخلفية. كل سطر من الشفرة كان إنجازًا، وكل تحدي كان فرصة للنمو. أصبح صنع واجهات بديهية وتصميم حلول قوية جزءًا من يومياتي.\n\nومع ذلك، فإن جوهر التطوير يتجاوز الشفرة. وجدت نفسي دائمًا متحديًا لترجمة احتياجات العملاء إلى حلول ملموسة. بالإضافة إلى ذلك، أصبح أمن البيانات واحترام خصوصية المستخدم جزءًا أساسيًا من عملي اليومي.\n\nهذه السنوات في التطوير ليست مجرد فصل واحد بل هي الأساس لما يأتي. أنا متحمس لاستغلال الفرص المستقبلية، وتطبيق المعرفة المكتسبة، والمساهمة في تشكيل المشهد التكنولوجي المتطور باستمرار.",
  "Intelie by Viasat": "Intelie بواسطة Viasat",
  "Mid-level Software Developer": "مطور برمجيات متوسط المستوى",
  "Junior Software Developer": "مطور برمجيات مبتدئ",
  "Software Developer Trainee": "متدرب مطور برمجيات",
  "Freelancer - Grupo Fratelli": "عمل حر - مجموعة Fratelli",
  "Computer Science BS - UERJ": "علوم الحاسوب - جامعة UERJ",
  "IT Techinical Education - IEPB": "تعليم تقني لتقنية المعلومات - IEPB",
  "Communication: How to express yourself effectively and be understood": "الاتصال: كيفية التعبير عن نفسك بفعالية والفهم",
  "Oratory 1": "الخطاب 1",
  "Oratory 2": "الخطاب 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "اختبارات الوحدة في جافا - JUnit، Mockito و TDD",
  "Vim Masterclass": "دورة ماجستير Vim",
  "Cisco CCNA": "سيسكو CCNA",
  "Domain Driven Design": "تصميم مدفوع بالنطاق",
  "Java Persistence API and Hibernate": "واجهة برمجة تطبيقات جافا للبقاء والهيبيرنيت",
  "Python 3 Basics": "أساسيات Python 3",
  "Languages": "اللغات",
  "Experiences": "تجارب",
  "Certifications": "الشهادات",
  "Projects": "مشاريع",
  "Made with": "صنع بواسطة",
  "by Lucas Morais": "بواسطة Lucas Morais",
  "About": "حول",
  "Educations": "تعليم",
  "Time worked": "الوقت المشتغل",
  "Now": "الآن",
  "hours worked": "ساعات العمل",
  "Brazil": "البرازيل",
  "United States of America": "الولايات المتحدة",
  "France": "فرنسا",
  "Spain": "إسبانيا",
  "South Korea": "كوريا الجنوبية",
  "Japan": "اليابان",
  "Germany": "ألمانيا",
  "Italy": "إيطاليا",
  "China": "الصين",
  "Saudi Arabia": "المملكة العربية السعودية",
  "Portuguese": "البرتغالية",
  "English": "الإنجليزية",
  "French": "الفرنسية",
  "Spanish": "الأسبانية",
  "Korean": "الكورية",
  "Japanese": "اليابانية",
  "German": "الألمانية",
  "Italian": "الإيطالية",
  "Chinese": "الصينية",
  "Arabic": "العربية",
  "year": "سنة",
  "years": "سنوات",
  "month": "شهر",
  "months": "أشهر",
  "day": "يوم",
  "days": "أيام",
  "High School": "المدرسة الثانوية",
  "Instituto de Educação Pereira Batista": "معهد التعليم بيريرا باتيستا",
  "Colégio Casimiro de Abreu": "كلية كاسيميرو دي أبريو",
  "Primary School": "المدرسة الابتدائية",
  "Centro Educacional Vilar Novo": "مركز تعليمي فيلار نوفو",
  "Fundação Pestalozzi": "مؤسسة بيستالوزي",
  "Colégio Soberano": "كلية سوبرانو",
  "Java Multithreading Concurrency Performance Optimization": "جافا البرمجة المتعددة الخيوط، التزامن وتحسين الأداء",
  "Learn Rust By Building Real Applications": "تعلم Rust من خلال بناء تطبيقات حقيقية","**Common Data Framework (CoDaF)**: I became one of the main technical leaders responsible for maintaining and enhancing functionalities of an internal framework for the persistence of common data, creating a centralized base for different projects.\n\n**CoDaF Wells and Rigs**: I interviewed specialists and modeled a general-use database for oil and gas solutions, resulting in approximately 100 entities.\n\n**Atria**: I technically led and implemented a pilot project to integrate real-time Machine Learning processing data related to the integrity status of multiple antennas.\n\n**License Manager**: I architected, scoped, and implemented the License Manager, a project to control and monitor client access to products (plugins) according to the contracted license, preventing misuse of the solutions in embedded environments. I prepared a presentation explaining the high-level functionality for the responsible managers.\n\n**Rig State**: I performed reverse engineering on an application without adequate documentation to provide greater clarity to managers about the implemented business rules, allowing for the necessary modifications to proceed.": "**Common Data Framework (CoDaF)**: أصبحت أحد القادة الفنيين الرئيسيين المسؤولين عن صيانة وتعزيز وظائف إطار العمل الداخلي لاحتفاظ البيانات المشتركة، مما خلق قاعدة مركزية لمشاريع مختلفة.\n\n**CoDaF Wells and Rigs**: أجريت مقابلات مع المتخصصين ونمذجة قاعدة بيانات للاستخدام العام للحلول النفطية والغازية، مما أسفر عن حوالي 100 كيان.\n\n**Atria**: قادت تقنيًا ونفذت مشروعًا تجريبيًا لدمج بيانات معالجة تعلم الآلة في الوقت الفعلي المتعلقة بحالة تكامل عدة هوائيات.\n\n**License Manager**: قمت بتصميم وتحديد نطاق وتنفيذ نظام إدارة التراخيص، وهو مشروع للتحكم ومراقبة وصول العملاء إلى المنتجات (الإضافات) وفقًا للتراخيص المتعاقد عليها، مما يمنع سوء استخدام الحلول في البيئات المدمجة. أعددت عرضًا تقديميًا يشرح الوظائف على مستوى عالٍ للمديرين المسؤولين.\n\n**Rig State**: أجريت تحليلًا عكسيًا لتطبيق بدون توثيق كافٍ لتوفير وضوح أكبر للمديرين حول قواعد الأعمال التي تم تنفيذها، مما يسمح بإجراء التعديلات اللازمة.",
  "**Sequence Builder + Cost Tracker**: I was among the main contributors to the development of Sequence Builder, a system that generates simulations resulting in a sequence of operations with time estimates based on historical data for planning oil well activities. In parallel, there was the development of Cost Tracker, which works coupled with Sequence Builder by adding cost estimates for each operation during the simulation. Additionally, it allows the updating and monitoring of these operations based on real data, enabling comparisons between the planned and the executed.\n\n**Dynamic Risk Advisor (DRA)**: I temporarily participated in the development of the DRA project, a tool based on the bowtie methodology, allowing the user to manage and monitor barriers and alerts in real-time, aiming for optimized operational risk management.": "**Sequence Builder + Cost Tracker**: كنت من بين المساهمين الرئيسيين في تطوير Sequence Builder، وهو نظام ينشئ محاكاة تؤدي إلى تسلسل العمليات مع تقديرات زمنية بناءً على البيانات التاريخية لتخطيط أنشطة آبار النفط. في الوقت نفسه، تم تطوير Cost Tracker، الذي يعمل بالتوازي مع Sequence Builder من خلال إضافة تقديرات التكاليف لكل عملية خلال المحاكاة. بالإضافة إلى ذلك، فإنه يسمح بتحديث ومراقبة هذه العمليات استنادًا إلى البيانات الفعلية، مما يتيح المقارنات بين المخطط والتنفيذ.\n\n**Dynamic Risk Advisor (DRA)**: شاركت مؤقتًا في تطوير مشروع DRA، وهي أداة تعتمد على منهجية البوتاي، مما يسمح للمستخدم بإدارة ومراقبة الحواجز والتنبيهات في الوقت الفعلي، بهدف تحسين إدارة المخاطر التشغيلية.",
  "**Campaign Planner:** Contributed to the development of new features, maintenance, and compatibility with legacy browsers in an oil and gas operations campaign management application.\n\n**PDF Extractor:** Responsible for implementing a script to convert various PDF files into a specific CSV format using OCR, assisting the research team in obtaining structured data for machine learning models.": "**Campaign Planner:** ساهمت في تطوير ميزات جديدة وصيانة وتوافق مع المتصفحات القديمة في تطبيق إدارة حملات عمليات النفط والغاز.\n\n**PDF Extractor:** مسؤول عن تنفيذ سكربت لتحويل ملفات PDF المختلفة إلى تنسيق CSV محدد باستخدام OCR، مما يساعد فريق البحث في الحصول على بيانات منظمة لنماذج التعلم الآلي."
}
