{
  "A full-stack developer focused on results, with strong skills in performance optimization and efficiency. Committed to delivering pragmatic solutions that delivers what the customer needs with etichal and responsability.": "成果に焦点を当てたフルスタック開発者で、パフォーマンスの最適化と効率化に強いスキルを持っています。倫理的責任を持って、顧客のニーズに応じた実用的な解決策を提供します。",
  "In recent years, my journey in development has been marked by a challenging narrative, filled with achievements and significant learnings. When I embarked on this journey, I faced a steep learning curve, delving into the complexities of both front-end and back-end. Every line of code was an accomplishment, and every challenge was an opportunity for growth. Crafting intuitive interfaces and architecting robust solutions became my daily mantra.\n\nHowever, the true essence of development goes beyond the code. I found myself consistently challenged to translate customer needs into tangible solutions. Additionally, the importance of data security and respect for user privacy became integral aspects of my daily work.\n\nThese years in development are not just a chapter but the foundation for what lies ahead. I am excited to embrace future opportunities, apply the knowledge gained, and contribute to shaping the ever-evolving technological landscape.": "この数年間の開発の旅は、挑戦的な物語で満ちており、多くの成果と重要な学びがあります。この旅に乗り出したとき、私は急激な学習曲線に直面し、フロントエンドとバックエンドの複雑さに没頭しました。コードの各行は成就であり、すべての挑戦は成長の機会でした。直感的なインターフェースの作成と堅牢な解決策の設計が私の日課となりました。\n\nしかし、開発の真の本質はコードを超えています。顧客のニーズを具体的な解決策に変換することに常に挑戦していました。さらに、データセキュリティの重要性とユーザーのプライバシーへの尊重が私の日常の重要な側面となりました。\n\nこれらの開発の数年間は単なる章に過ぎず、これからの基盤です。将来の機会を受け入れ、得た知識を活用し、常に変化する技術的な景観を形作ることに興奮しています。",
  "Intelie by Viasat": "インテリ by ヴィアサット",
  "Mid-level Software Developer": "中級ソフトウェア開発者",
  "Junior Software Developer": "ジュニアソフトウェア開発者",
  "Software Developer Trainee": "ソフトウェア開発者研修生",
  "Freelancer - Grupo Fratelli": "フリーランサー - グルーポ フラテッリ",
  "Computer Science BS - UERJ": "コンピュータサイエンス BS - UERJ",
  "IT Techinical Education - IEPB": "IT 技術教育 - IEPB",
  "Communication: How to express yourself effectively and be understood": "コミュニケーション: 効果的に表現し、理解される方法",
  "Oratory 1": "弁論 1",
  "Oratory 2": "弁論 2",
  "Unit Tests in Java - JUnit, Mockito and TDD": "Java のユニットテスト - JUnit、Mockito、および TDD",
  "Vim Masterclass": "Vim マスタークラス",
  "Cisco CCNA": "シスコ CCNA",
  "Domain Driven Design": "ドメイン駆動設計",
  "Java Persistence API and Hibernate": "Java 永続性 API および Hibernate",
  "Python 3 Basics": "Python 3 基礎",
  "Languages": "言語",
  "Experiences": "経験",
  "Certifications": "認定",
  "Projects": "プロジェクト",
  "Made with": "で作成",
  "by Lucas Morais": "Lucas Morais 制作",
  "About": "約",
  "Educations": "教育"
}

